---
type: CurveLoopIterator
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# CurveLoopIterator

`Autodesk.Revit.DB.CurveLoopIterator` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | MoveNext | 2013 | `public virtual bool MoveNext ()` |
| Method | Reset | 2013 | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Curve Current { get ; }` |
| Property | CurrentObject | — | `internal Object CurrentObject { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |